Revit 2026 API
BRepBuilderSurfaceGeometry Class
 An abstract class used by BRepBuilder to represent the geometry of a surface. Specific surface-geometry representations are represented by subclasses.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BRepBuilderSurfaceGeometry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class BRepBuilderSurfaceGeometry : IDisposable
Public Class BRepBuilderSurfaceGeometry
	Implements IDisposable
public ref class BRepBuilderSurfaceGeometry : IDisposable
type BRepBuilderSurfaceGeometry =
    class
        interface IDisposable
    end
The BRepBuilderSurfaceGeometry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Create |  Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface.
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, Boolean, BoundingBoxUV)
CreateNURBSSurface(Int32, Int32, IList<Double>, IList<Double>, IList<XYZ>, IList<Double>, Boolean, BoundingBoxUV)
Dispose | Releases all resources used by the BRepBuilderSurfaceGeometry
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace